Revit 2027 API
BuiltInFailures.DimensionFailures.CannotLockThisDimension Property
 Can't lock this Dimension because it breaks formulas
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotLockThisDimension { get; }
Public Shared ReadOnly Property CannotLockThisDimension As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotLockThisDimension {
	FailureDefinitionId^ get ();
}
static member CannotLockThisDimension : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace